<?php

namespace StopWords;

class Sanitizer
{
    private const TO_REMOVE = [
        ',', '.', ';', '<', '>', '/', '?', '$', '-', '_', '+', '!', '*', '"', '\'', '(', ')', '{', '}', '[', ']', '|',
        '\\', ':', '=', '&', '^', '%', '‰', '#', '@', '!', '~', '`', '€', 'ƒ', '„', '…', '†', '‡', 'Š', '‹', 'Œ', '™',
        '—', '•', '£', '¢', '¡', '¤', '¥', '¦', '§', '¨', '©', 'ª', '«', '¬', '®', '¯', '°', '±', '²', '³', '´', 'µ',
        '¶', '·', '¸', '¹', 'º', '»', '¼', '½', '¾', '¿', '×', '÷',
    ];

    public static function sanitize(string $message) : string
    {
        return trim(str_replace(self::TO_REMOVE, ' ', $message));
    }
}
